Repository: poiz777/poiz-csv-lister-for-typo3
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de, fr

# tx_poiz_csv_lister_domain_model_pzcsvlister.description
source: An Extension for listing out the contents of a CSV File. If an uploaded CSV File contains entries with path to image files (jpg, png, gif), the entries are directly rendered as images and if the image URI is invalid, a default NOT-FOUND image is used instead. Entries are rendered using HTML Table.
fr: Une extension pour lister le contenu d'un fichier CSV. Si un fichier CSV téléchargé contient des entrées avec un chemin d'accès aux fichiers image (jpg, png, gif), les entrées sont directement affichées sous forme d'images et si l'URI de l'image n'est pas valide, une image par défaut NOT-FOUND est utilisée. Les entrées sont rendues à l'aide de la table HTML.

# poiz_csv_lister.pi_flexform.heading_title
source: Heading Title (Displayed at the top of the List).
de: Überschriftentitel (wird oben in der Liste angezeigt).
fr: Titre (affiché en haut de la liste).

# poiz_csv_lister.pi_flexform.heading_placeholder
source: Leave empty to skip Title Display.
de: Leer lassen, um die Titelanzeige zu überspringen.
fr: Laissez vide pour ignorer l'affichage du titre.

# poiz_csv_lister.pi_flexform.csv_id_note_label
source: A Note on the Fields above:>
de: Ein Hinweis zu den obigen Feldern:
fr: Une note sur les champs ci-dessus:

# poiz_csv_lister.pi_flexform.option_yes
source: Yes
de: Ja
fr: Oui

# poiz_csv_lister.pi_flexform.option_no
source: No
de: Nein
fr: Non

# poiz_csv_lister.pi_flexform.list_and_link_csv_label
source: List & Link all CSV Files?
de: Alle CSV-Dateien auflisten und verknüpfen?
fr: Lister et lier tous les fichiers CSV?

# poiz_csv_lister.pi_flexform.initial_render_id_label
source: The ID of the initial CSV File to be rendered on this Page
de: Die ID der ursprünglichen CSV-Datei, die auf dieser Seite gerendert werden soll
fr: L'identifiant du fichier CSV initial à rendre sur cette page

# poiz_csv_lister.pi_flexform.initial_render_id_placeholder
source: Leave empty to skip Title Display.
de: Sie können die ID aus dem CSV-Lister-Konfigurationsbereich kopieren.
fr: Vous pouvez copier l'ID à partir du volet de configuration Lister CSV.

# poiz_csv_lister.pi_flexform.csv_id_note_info
source: If you selected «No» on «List & Link all CSV Files?» above Then You must supply the ID of CSV File to be rendered otherwise Nothing will be visible on the Frontend. To get the ID of the CSV, please go to the Configuration Page. Click on the CSV List Menu to list all the available CSV Files. On the Left of each File is a Number representing the ID of the File. Choose the one that applies. Setting «List & Link all CSV Files?» to «Yes» will automatically create an unordered List of clickable Links which point to the respective CSV File(s).
de: Wenn Sie bei «Alle CSV-Dateien auflisten und verknüpfen» oben «Nein» gewählt haben Dann müssen Sie die ID der CSV-Datei angeben, die andernfalls gerendert werden soll Nichts wird auf dem Frontend sichtbar sein. Um die ID der CSV zu erhalten, gehen Sie bitte auf die Konfigurationsseite. Klicken im CSV-Listenmenü, um alle verfügbaren CSV-Dateien aufzulisten. Links von Jede Datei ist eine Zahl, die die ID der Datei darstellt. Wählen Sie das zutreffende aus. Die Einstellung «Alle CSV-Dateien auflisten und verknüpfen» mit «Ja» wird automatisch ein ungeordnete Liste der anklickbaren Links, die auf die jeweilige(n) CSV-Datei(en) zeigen.
fr: Si vous avez sélectionné «Non» dans «Répertorier et lier tous les fichiers CSV?» Ci-dessus, vous devez fournir l'ID du fichier CSV à afficher sinon rien ne sera visible sur le Frontend. Pour obtenir l'ID du fichier CSV, accédez à la page de configuration. Cliquez sur le menu Liste CSV pour répertorier tous les fichiers CSV disponibles. À gauche de chaque fichier se trouve un numéro représentant l'ID du fichier. Choisissez celui qui s'applique. Si vous définissez «Lister et lier tous les fichiers CSV?» À «Oui», vous créez automatiquement une liste non ordonnée de liens cliquables qui pointent vers le ou les fichiers CSV respectifs.

# poiz_csv_lister.pi_flexform.render_pix_uri_as_pix_image
source: Render Image URI as Images?
de: Bild-URI als Bilder rendern?
fr: Rendre l'image URI en images?

# poiz_csv_lister.miscellaneous.csv_files_list
source: CSV File List
de: CSV-Dateiliste
fr: Liste de fichiers CSV

# poiz_csv_lister.miscellaneous.uploaded_csv_file
source: Uploaded CSV File(s)
de: Hochgeladene(n) CSV Datei(en)
fr: Fichier CSV téléchargé

# poiz_csv_lister.miscellaneous.add_csv_file
source: Add CSV File
de: CSV Datei hinzufügen
fr: Ajouter un fichier CSV

# poiz_csv_lister.miscellaneous.csv_files_listing
source: CSV Files Listing
de: CSV-Dateiauflistung
fr: Listes des fichiers CSV

# poiz_csv_lister.miscellaneous.csv_list
source: CSV List
de: Liste der CSV-Dateien
fr: Liste de fichiers CSV

# poiz_csv_lister.miscellaneous.go_back
source: Back
de: Zurück
fr: Précédent

# poiz_csv_lister.miscellaneous.unique_lister_name
source: Unique CSV Lister Name
de: Eindeutiger CSV-Lister-Name
fr: Nom unique du Lister CSV

# poiz_csv_lister.miscellaneous.unique_lister_name_desc
source: This is the Unique Name of the CSV Lister
de: Dies ist der eindeutige Name des CSV-Listers
fr: Ceci est le nom unique du Lister CSV

# poiz_csv_lister.miscellaneous.al_num_ok
source: Alphanumeric Characters are permissible!
de: Alphanumerische Zeichen sind zulässig!
fr: Les caractères alphanumériques sont autorisés!

# poiz_csv_lister.miscellaneous.uploaded_csv_files
source: Uploaded CSV File(s)
de: Hochgeladene CSV-Datei(en)
fr: Fichier(s) CSV téléchargé(s)

# poiz_csv_lister.miscellaneous.upload_csv_file
source: Upload CSV File
de: CSV-Date hochladen
fr: Télécharger un fichier CSV

# poiz_csv_lister.miscellaneous.optional
source: [Optional]
de: [Wahlweise]
fr: [Optionnel]

# poiz_csv_lister.miscellaneous.uploader_hint
source: The File uploaded here is Uniquely for the Selected CSV Entity.
de: Die hier hochgeladene Datei ist für die ausgewählte CSV-Entität eindeutig.
fr: Le fichier téléchargé ici est unique pour l'entité CSV sélectionnée.

# poiz_csv_lister.miscellaneous.upload_info
source: Upload Info
de: Hochladungs-Information
fr: Infos sur le téléchargement

# poiz_csv_lister.miscellaneous.drop_csv
source: Drop a CSV File below
de: Legen Sie unten eine CSV-Datei ab
fr: Déposez un fichier CSV ci-dessous

# poiz_csv_lister.miscellaneous.save
source: Save
de: Speichern
fr: Enregistrer

# poiz_csv_lister.miscellaneous.edit_csv
source: Edit CSV
de: CSV bearbeiten
fr: Modifier CSV

# poiz_csv_lister.miscellaneous.delete_csv
source: Delete CSV
fr: Supprimer CSV

# poiz_csv_lister.miscellaneous.preview_csv_data
source: Preview
de: Vorschau
fr: Aperçu

# poiz_csv_lister.miscellaneous.management_pane_title
source: Poiz CSV-Lister: Management Pane
de: Poiz CSV-Lister: Verwaltungsfenster
fr: Poiz CSV-Lister: Volet de gestion

# poiz_csv_lister.miscellaneous.delete_csv
source: Delete CSV
de: CSV löschen
